# parameters
nc: 20  # number of classes
depth_multiple: 0.33  # model depth multiple 控制模型的深度（C3个数） number 非1 时相乘
width_multiple: 0.50  # layer channel multiple 控制Conv通道channel个数（卷积核数量） 使模型精度更高
# depth_multiple表示C3模块的缩放因子，将所有C3模块的Bottleneck乘上该参数得到最终个数。
# width_multiple表示卷积通道的缩放因子，就是将配置里面的backbone和head部分有关Conv通道的设置，全部乘以该系数。
# 通过这两个参数就可以实现不同复杂度的模型设计。

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8  wh  stride=8 8倍下采样后anchor大小    2^3 = 8
  - [30,61, 62,45, 59,119]  # P4/16 16倍下采样后该尺度上anchor的大小    2^4 = 16
  - [116,90, 156,198, 373,326]  # P5/32 32倍下采样后anchor的大小        2^5 = 32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  # from表示当前模块的输入来自那一层的输出，-1表示来自上一层的输出
  # number表示本模块重复的次数，1表示只有一个，3表示重复3次
  # module: 模块名                               [输入,模块输出channel（最终还要乘以width_multiple）, 模块其他参数]
  [[-1, 1, Focus, [64, 3]],          # 0-P1/2   [3, 32, 3]  future map变为原图的1/2
   [-1, 1, Conv, [128, 3, 2]],       # 1-P2/4   [32, 64, 3, 2] 128表示128个卷积核 3表示3*3的卷积核 2表示步长   128*width_multiple = 64 ，future map变为原图的1/4
   [-1, 3, C3, [128]],               # 2        [64, 64, 1]
   [-1, 1, Conv, [256, 3, 2]],       # 3-P3/8   [64, 128, 3, 2] future map变为原图的1/8
   [-1, 9, C3, [256]],               # 4        [128, 128, 3]
   [-1, 1, Conv, [512, 3, 2]],       # 5-P4/16  [128, 256, 3, 2]
   [-1, 9, C3, [512]],               # 6        [256, 256, 3]
   [-1, 1, Conv, [1024, 3, 2]],      # 7-P5/32  [256, 512, 3, 2]
   [-1, 1, SPP, [1024, [5, 9, 13]]], # 8        [512, 512, [5, 9, 13]]
   [-1, 3, C3, [1024, False]],       # 9        [512, 512, 1, False]
  ]


# YOLOv5 head  作者没有区分neck模块，所以head部分包含了PANet+Detect部分  bottleneck+csp
head:
  [[-1, 1, Conv, [512, 1, 1]], # 10                 [512, 256, 1, 1]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11 [None, 2, 'nearest']
   [[-1, 6], 1, Concat, [1]],  # 12 cat backbone P4 [1]
   [-1, 3, C3, [512, False]],  # 13                 [512, 256, 1, False]

   [-1, 1, Conv, [256, 1, 1]], # 14                 [256, 128, 1, 1]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #15  [None, 2, 'nearest']
   [[-1, 4], 1, Concat, [1]],  # 16 cat backbone P3 [1]
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)    [256, 128, 1, False] 小目标

   [-1, 1, Conv, [256, 3, 2]], # 18                 [128, 128, 3, 2]
   [[-1, 14], 1, Concat, [1]], # 19 cat head P4     [1]
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)  [256, 256, 1, False] 中目标

   [-1, 1, Conv, [512, 3, 2]], # 21                 [256, 256, 3, 2]
   [[-1, 10], 1, Concat, [1]], # 22 cat head P5     [1]
   [-1, 3, C3, [1024, False]], # 23 (P5/32-large)   [512, 512, 1, False] 大目标


   [[17, 20, 23], 1, Detect, [nc, anchors]],  # 24  Detect(P3, P4, P5)
   # 从17 20 23 层输入 即17 20 23层的输出再做detect
   # [nc, anchors, 3个Detect的输出channel]
   # [1, [[10, 13, 16, 30, 33, 23], [30, 61, 62, 45, 59, 119], [116, 90, 156, 198, 373, 326]], [128, 256, 512]]
  ]
